### Terraform CI Summary

**Initialization:** ✅ `success` 
**Validation & Format:** ✅ `success` 
**Plan:** ✅ `success` 

<details>
<summary>Show Terraform Plan</summary>

```
[0m[1mmodule.kube-hetzner.random_password.rancher_bootstrap[0]: Refreshing state... [id=none][0m
[0m[1mmodule.kube-hetzner.data.hcloud_image.microos_arm_snapshot: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.data.hcloud_image.microos_x86_snapshot: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.hcloud_placement_group.agent[0]: Refreshing state... [id=1128774][0m
[0m[1mmodule.kube-hetzner.hcloud_ssh_key.k3s[0]: Refreshing state... [id=101198045][0m
[0m[1mmodule.kube-hetzner.hcloud_load_balancer.cluster[0]: Refreshing state... [id=4314048][0m
[0m[1mmodule.kube-hetzner.hcloud_firewall.k3s: Refreshing state... [id=2383708][0m
[0m[1mmodule.kube-hetzner.hcloud_placement_group.control_plane[0]: Refreshing state... [id=1128775][0m
[0m[1mmodule.kube-hetzner.random_password.k3s_token: Refreshing state... [id=none][0m
[0m[1mmodule.kube-hetzner.hcloud_network.k3s[0]: Refreshing state... [id=11375891][0m
[0m[1mmodule.kube-hetzner.data.hcloud_ssh_keys.keys_by_selector[0]: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.data.hcloud_ssh_keys.keys_by_selector[0]: Read complete after 1s[0m
[0m[1mmodule.kube-hetzner.data.hcloud_image.microos_x86_snapshot: Read complete after 1s[0m
[0m[1mmodule.kube-hetzner.data.hcloud_image.microos_arm_snapshot: Read complete after 1s[0m
[0m[1mmodule.kube-hetzner.data.hcloud_network.k3s: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.data.hcloud_network.k3s: Read complete after 0s [name=kube-baphomet][0m
[0m[1mmodule.kube-hetzner.hcloud_network_subnet.control_plane[1]: Refreshing state... [id=11375891-10.254.0.0/16][0m
[0m[1mmodule.kube-hetzner.hcloud_network_subnet.control_plane[0]: Refreshing state... [id=11375891-10.255.0.0/16][0m
[0m[1mmodule.kube-hetzner.hcloud_network_subnet.agent[1]: Refreshing state... [id=11375891-10.1.0.0/16][0m
[0m[1mmodule.kube-hetzner.hcloud_network_subnet.control_plane[2]: Refreshing state... [id=11375891-10.253.0.0/16][0m
[0m[1mmodule.kube-hetzner.hcloud_network_subnet.agent[2]: Refreshing state... [id=11375891-10.2.0.0/16][0m
[0m[1mmodule.kube-hetzner.hcloud_network_subnet.agent[0]: Refreshing state... [id=11375891-10.0.0.0/16][0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].random_string.server: Refreshing state... [id=tcf][0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].random_string.identity_file: Refreshing state... [id=ack8d1rw3da35gdtdlea][0m
[0m[1mmodule.kube-hetzner.module.control_planes["2-0-control-plane-2"].random_string.server: Refreshing state... [id=guk][0m
[0m[1mmodule.kube-hetzner.module.control_planes["2-0-control-plane-2"].random_string.identity_file: Refreshing state... [id=ceugeutr5yb2bfy02a2m][0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-0"].random_string.identity_file: Refreshing state... [id=2ciidzxotsw3pcb8rt1s][0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-0"].random_string.server: Refreshing state... [id=kqe][0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-worker-2"].random_string.identity_file: Refreshing state... [id=blr30f3nobmrrgky6626][0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-worker-1"].random_string.identity_file: Refreshing state... [id=pi4dwfd521jpz3ysc6xd][0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-worker-0"].random_string.identity_file: Refreshing state... [id=xrc0q284y15q5xz2ybaj][0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-worker-0"].random_string.server: Refreshing state... [id=xdb][0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-worker-2"].random_string.server: Refreshing state... [id=tst][0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-worker-1"].random_string.server: Refreshing state... [id=zuq][0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].data.cloudinit_config.config: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.module.control_planes["2-0-control-plane-2"].data.cloudinit_config.config: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-0"].data.cloudinit_config.config: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-0"].data.cloudinit_config.config: Read complete after 0s [id=2535611686][0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].data.cloudinit_config.config: Read complete after 0s [id=1050621717][0m
[0m[1mmodule.kube-hetzner.module.control_planes["2-0-control-plane-2"].data.cloudinit_config.config: Read complete after 0s [id=2699487032][0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-0"].hcloud_server.server: Refreshing state... [id=107407799][0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].hcloud_server.server: Refreshing state... [id=107407797][0m
[0m[1mmodule.kube-hetzner.module.control_planes["2-0-control-plane-2"].hcloud_server.server: Refreshing state... [id=107407798][0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-worker-2"].data.cloudinit_config.config: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-worker-0"].data.cloudinit_config.config: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-worker-1"].data.cloudinit_config.config: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-worker-2"].data.cloudinit_config.config: Read complete after 0s [id=843582948][0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-worker-0"].data.cloudinit_config.config: Read complete after 0s [id=1107850833][0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-worker-1"].data.cloudinit_config.config: Read complete after 0s [id=1757436104][0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-worker-2"].hcloud_server.server: Refreshing state... [id=107407800][0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-worker-0"].hcloud_server.server: Refreshing state... [id=107407802][0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-worker-1"].hcloud_server.server: Refreshing state... [id=107407801][0m
[0m[1mmodule.kube-hetzner.module.control_planes["2-0-control-plane-2"].null_resource.registries: Refreshing state... [id=4507247419668756546][0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].null_resource.registries: Refreshing state... [id=6661395968576835637][0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-0"].null_resource.registries: Refreshing state... [id=7276282196809619703][0m
[0m[1mmodule.kube-hetzner.module.control_planes["2-0-control-plane-2"].hcloud_rdns.server[0]: Refreshing state... [id=s-107407798-65.108.83.235][0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].hcloud_rdns.server[0]: Refreshing state... [id=s-107407797-91.98.29.19][0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-0"].null_resource.zram: Refreshing state... [id=8123680500621726593][0m
[0m[1mmodule.kube-hetzner.module.control_planes["2-0-control-plane-2"].hcloud_server_network.server: Refreshing state... [id=107407798-11375891][0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].null_resource.zram: Refreshing state... [id=4218071823392138080][0m
[0m[1mmodule.kube-hetzner.module.control_planes["2-0-control-plane-2"].null_resource.zram: Refreshing state... [id=4263012478666823582][0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-0"].hcloud_rdns.server[0]: Refreshing state... [id=s-107407799-5.75.224.184][0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].hcloud_server_network.server: Refreshing state... [id=107407797-11375891][0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-0"].hcloud_server_network.server: Refreshing state... [id=107407799-11375891][0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-worker-2"].null_resource.registries: Refreshing state... [id=8574074115498977364][0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-worker-1"].null_resource.zram: Refreshing state... [id=8155048389253190935][0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-worker-2"].null_resource.zram: Refreshing state... [id=1071761586142212816][0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-worker-0"].null_resource.registries: Refreshing state... [id=136481414254336343][0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-worker-0"].null_resource.zram: Refreshing state... [id=944481461217129582][0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-worker-1"].null_resource.registries: Refreshing state... [id=3036590265152882616][0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-worker-2"].hcloud_server_network.server: Refreshing state... [id=107407800-11375891][0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-worker-2"].hcloud_rdns.server[0]: Refreshing state... [id=s-107407800-195.201.238.37][0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-worker-0"].hcloud_rdns.server[0]: Refreshing state... [id=s-107407802-95.216.160.119][0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-worker-1"].hcloud_rdns.server[0]: Refreshing state... [id=s-107407801-188.245.148.8][0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-worker-0"].hcloud_server_network.server: Refreshing state... [id=107407802-11375891][0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-worker-1"].hcloud_server_network.server: Refreshing state... [id=107407801-11375891][0m
[0m[1mmodule.kube-hetzner.data.github_release.hetzner_ccm[0]: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.data.github_release.kured[0]: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.data.github_release.hetzner_csi[0]: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.data.github_release.kured[0]: Read complete after 0s [id=203405526][0m
[0m[1mmodule.kube-hetzner.null_resource.first_control_plane: Refreshing state... [id=5126708001534352275][0m
[0m[1maws_route53_record.rancher_ipv6: Refreshing state... [id=Z00476003F8RX1KPNHHY4_rancher.baphomet.cloud_AAAA][0m
[0m[1maws_route53_record.rancher_ipv4: Refreshing state... [id=Z00476003F8RX1KPNHHY4_rancher.baphomet.cloud_A][0m
[0m[1maws_route53_record.api_ipv4: Refreshing state... [id=Z00476003F8RX1KPNHHY4_api.baphomet.cloud_A][0m
[0m[1maws_route53_record.api_ipv6: Refreshing state... [id=Z00476003F8RX1KPNHHY4_api.baphomet.cloud_AAAA][0m
[0m[1maws_route53_record.lb_ipv4: Refreshing state... [id=Z00476003F8RX1KPNHHY4_lb.baphomet.cloud_A][0m
[0m[1maws_route53_record.lb_ipv6: Refreshing state... [id=Z00476003F8RX1KPNHHY4_lb.baphomet.cloud_AAAA][0m
[0m[1mmodule.kube-hetzner.data.github_release.hetzner_ccm[0]: Read complete after 0s [id=229419124][0m
[0m[1mmodule.kube-hetzner.null_resource.authentication_config["2-0-control-plane-2"]: Refreshing state... [id=513418226558308615][0m
[0m[1mmodule.kube-hetzner.null_resource.authentication_config["0-0-control-plane-0"]: Refreshing state... [id=256337657943273387][0m
[0m[1mmodule.kube-hetzner.null_resource.authentication_config["1-0-control-plane-1"]: Refreshing state... [id=5010846007428825281][0m
[0m[1mmodule.kube-hetzner.null_resource.control_plane_config["1-0-control-plane-1"]: Refreshing state... [id=1966851398555216815][0m
[0m[1mmodule.kube-hetzner.null_resource.control_plane_config["2-0-control-plane-2"]: Refreshing state... [id=2203026968823559300][0m
[0m[1mmodule.kube-hetzner.null_resource.control_plane_config["0-0-control-plane-0"]: Refreshing state... [id=4797124990455433131][0m
[0m[1mmodule.kube-hetzner.null_resource.control_planes["0-0-control-plane-0"]: Refreshing state... [id=831765462730514909][0m
[0m[1mmodule.kube-hetzner.null_resource.control_planes["1-0-control-plane-1"]: Refreshing state... [id=5951657394912381206][0m
[0m[1mmodule.kube-hetzner.null_resource.control_planes["2-0-control-plane-2"]: Refreshing state... [id=4638572859732213061][0m
[0m[1mmodule.kube-hetzner.data.remote_file.kubeconfig: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.local_file.kustomization_backup[0]: Refreshing state... [id=253a2d9557fbb9386b1781085b8f8e9af4111965][0m
[0m[1mmodule.kube-hetzner.null_resource.agent_config["0-0-worker-0"]: Refreshing state... [id=6225791586316572618][0m
[0m[1mmodule.kube-hetzner.null_resource.agent_config["1-0-worker-1"]: Refreshing state... [id=4239578401722528858][0m
[0m[1mmodule.kube-hetzner.null_resource.agent_config["2-0-worker-2"]: Refreshing state... [id=7627039589255041576][0m
[0m[1mmodule.kube-hetzner.null_resource.agents["2-0-worker-2"]: Refreshing state... [id=6386937246955568271][0m
[0m[1mmodule.kube-hetzner.null_resource.agents["1-0-worker-1"]: Refreshing state... [id=113136052315297127][0m
[0m[1mmodule.kube-hetzner.null_resource.agents["0-0-worker-0"]: Refreshing state... [id=9116772250203306008][0m
[0m[1mmodule.kube-hetzner.data.github_release.hetzner_csi[0]: Read complete after 0s [id=237686054][0m
[0m[1mmodule.kube-hetzner.null_resource.kustomization: Refreshing state... [id=2181436007945956226][0m
[0m[1mmodule.kube-hetzner.data.remote_file.kubeconfig: Read complete after 7s [id=5.75.224.184:22:/etc/rancher/k3s/k3s.yaml][0m
[0m[1mmodule.kube-hetzner.local_sensitive_file.kubeconfig[0]: Refreshing state... [id=b92fd22ec9f9bcd8d9e36999c226cc4a5d586eac][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # module.kube-hetzner.local_file.kustomization_backup[0][0m will be created
[0m  [32m+[0m[0m resource "local_file" "kustomization_backup" {
      [32m+[0m[0m content              = <<-EOT
            "apiVersion": "kustomize.config.k8s.io/v1beta1"
            "kind": "Kustomization"
            "patches":
            - "patch": |
                apiVersion: apps/v1
                kind: Deployment
                metadata:
                  name: system-upgrade-controller
                  namespace: system-upgrade
                spec:
                  template:
                    spec:
                      containers:
                        - name: system-upgrade-controller
                          volumeMounts:
                            - name: ca-certificates
                              mountPath: /var/lib/ca-certificates
                      volumes:
                        - name: ca-certificates
                          hostPath:
                            path: /var/lib/ca-certificates
                            type: Directory
              "target":
                "group": "apps"
                "kind": "Deployment"
                "name": "system-upgrade-controller"
                "namespace": "system-upgrade"
                "version": "v1"
            - "path": "kured.yaml"
            - "path": "ccm.yaml"
            "resources":
            - "https://github.com/hetznercloud/hcloud-cloud-controller-manager/releases/download/v1.26.0/ccm-networks.yaml"
            - "https://github.com/kubereboot/kured/releases/download/1.17.1/kured-1.17.1-dockerhub.yaml"
            - "https://github.com/rancher/system-upgrade-controller/releases/download/v0.14.2/system-upgrade-controller.yaml"
            - "https://github.com/rancher/system-upgrade-controller/releases/download/v0.14.2/crd.yaml"
            - "hcloud-csi.yaml"
            - "traefik_ingress.yaml"
            - "longhorn.yaml"
            - "cert_manager.yaml"
            - "rancher.yaml"
        EOT
      [32m+[0m[0m content_base64sha256 = (known after apply)
      [32m+[0m[0m content_base64sha512 = (known after apply)
      [32m+[0m[0m content_md5          = (known after apply)
      [32m+[0m[0m content_sha1         = (known after apply)
      [32m+[0m[0m content_sha256       = (known after apply)
      [32m+[0m[0m content_sha512       = (known after apply)
      [32m+[0m[0m directory_permission = "0777"
      [32m+[0m[0m file_permission      = "600"
      [32m+[0m[0m filename             = "kube-baphomet_kustomization_backup.yaml"
      [32m+[0m[0m id                   = (known after apply)
    }

[1m  # module.kube-hetzner.local_sensitive_file.kubeconfig[0][0m will be created
[0m  [32m+[0m[0m resource "local_sensitive_file" "kubeconfig" {
      [32m+[0m[0m content              = (sensitive value)
      [32m+[0m[0m content_base64sha256 = (known after apply)
      [32m+[0m[0m content_base64sha512 = (known after apply)
      [32m+[0m[0m content_md5          = (known after apply)
      [32m+[0m[0m content_sha1         = (known after apply)
      [32m+[0m[0m content_sha256       = (known after apply)
      [32m+[0m[0m content_sha512       = (known after apply)
      [32m+[0m[0m directory_permission = "0700"
      [32m+[0m[0m file_permission      = "600"
      [32m+[0m[0m filename             = "kube-baphomet_kubeconfig.yaml"
      [32m+[0m[0m id                   = (known after apply)
    }

[1mPlan:[0m 2 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>

*Pushed by @muchasxmaracas, Action: `pull_request`*